## Plan Result (dts_sharedservicesptl_sbox_acme)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_role_assignment.app-proxy-ga-service-connection-certificate-management[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.app-proxy-ga-service-connection-certificate-management[0] must be replaced
-/+ resource "azurerm_role_assignment" "app-proxy-ga-service-connection-certificate-management" {
      ~ id                               = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/sds-platform-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsptlsbox/providers/Microsoft.Authorization/roleAssignments/4556b6f5-4ca5-cb37-314c-78244c6ad695" -> (known after apply)
      ~ name                             = "4556b6f5-4ca5-cb37-314c-78244c6ad695" -> (known after apply)
      ~ principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> "dad693c4-36ad-468f-94e9-76faa4bc844b" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/providers/Microsoft.Authorization/roleDefinitions/a4417e6f-fecd-4de8-b567-7b0420556985" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":31,"Program":"tfcmt","SHA1":"","Target":"dts_sharedservicesptl_sbox_acme","Vars":{}} -->